auth-migration-rails-to-cognito/rails_authentication/app/models/user.rb

SELECT `api_keys`.* FROM `api_keys` WHERE `api_keys`.`access_token` IS NULL LIMIT 1
---
  def self.login?(access_token)
    api_key = ApiKey.find_by_access_token(access_token)