auth-migration-rails-to-cognito/rails_authentication/app/controllers/api/v1/users_controller.rb

      def create
        respond_to do |format|
          @user = User.new(user_params)
          binding.pry

          if @user.save
---
INSERT INTO `users` (`email`, `crypted_password`, `salt`, `created_at`, `updated_at`) VALUES ('sample@ggg.com', '$2a$10$8tWz6o9VxjwDNeb8YLYzS.PTPQX2VYA1rZVxDsMDdxYSehVeYexyO', 'xutkxhEbXsbaXMERsvo7', '2021-03-11 13:48:09.542247', '2021-03-11 13:48:09.542247')