auth-migration-rails-to-cognito/rails_authentication/app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `crypted_password`, `salt`, `created_at`, `updated_at`) VALUES ('akazawt+001@amazon.com', '$2a$10$PoYNOT5qrtVyMu7aKt4M4.XOn4rLL.HfXQBOJoMyP3TZU0pWEeffK', 'ezS4wFyzeMv57yUXoKHB', '2021-03-11 09:15:14.182094', '2021-03-11 09:15:14.182094')
---
  def create(user)
    @user = User.new(user.permit(:email, :password, :password_confirmation))

    if @user.save